learning/go-in-practice.org
#+TITLE: Go in Practice
#+AUTHOR: Stephen Heywood
#+EMAIL: stephen@ii.coop
#+CREATOR: ii.coop
#+DATE: 15th May, 2019
#+STARTUP: showeverything

* Objective

Given a synopsis of /Go in Practice/ with a focus on the code examples.

** Buy Book

Matt Farina and Matt Butcher wrote a helpful book that we use as the basis for our walkthrough.
Please purchase this book from them. We bought a copies for our team.

http://goinpracticebook.com/

** Access Book

*** ii pdf via nextcloud PDF viewer
https://nextcloud.ii.nz/apps/files/?dir=/iiFiles/Books&fileid=5114#pdfviewer

We might be able to skewer this for driving a web browser to follow the right links

*** pdf directly via docview

#+BEGIN_SRC emacs-lisp :results none
(setq nextcloud-login (read-string "Nextcloud Login : "))
(setq nextcloud-passwd (read-passwd "Nextcloud Pass : "))
#+END_SRC

#+noheader: :prologue "(\n"
#+noheader: :epilogue ") 2>&1\n:\n"
#+NOheader: :results 
#+noheader: :results link
#+noheader: :file "go-in-practice.pdf"
#+noheader: :export org
https://docs.nextcloud.com/server/13/user_manual/files/access_webdav.html
#+name: download pdf via next cloud webdav
#+header: :var LOGIN=(symbol-value 'nextcloud-login) PASS=(symbol-value 'nextcloud-passwd)
#+header: :eval no-export
#+BEGIN_SRC shell :prologue :wrap '(nil)
  rm -rf go-in-practive.pdf
  curl -s -S -u "${LOGIN}:${PASS}" -L \
    http://nextcloud.ii.nz/remote.php/webdav/iiFiles/Books/Go_in_Practice.pdf \
    -o go-in-practice.pdf
  ls -la go-in-practice.pdf
#+END_SRC

#+RESULTS: download pdf via next cloud webdav
-rw-rw-r-- 1 heyste heyste 9528205 May 29 08:01 go-in-practice.pdf
-rw-r--r-- 1 hippie hippie 9528205 May 28 14:16 go-in-practice.pdf

[[docview:go-in-practice.pdf::120]]
[[file:go-in-practice.pdf]]

** Access Source Examples
#+name: clone code examples
#+header: :results link
#+header: :file "./go-in-practice/"
#+header: :wrap '(nil)
#+header: :eval no-export
#+BEGIN_SRC shell
  git clone https://github.com/Masterminds/go-in-practice.git
#+END_SRC

#+RESULTS: clone code examples
[[file:./go-in-practice/]]


* Front Matter

** Table of Contents

- Foreword
- Preface
- Acknowledgments
- About this Book
- About the Authors
- About the Cover Illustration
- Part 1. Background and fundamentals
  - Ch 1. Getting into Go
  - Ch 2. A solid foundation
  - Ch 3. Concurrency in Go
- Part 2. Well-rounded applications
  - Ch 4. Handling errors and panics
  - Ch 5. Debugging and testing
- Part 3. An interface for your applications
  - Ch 6. HTML and email template patterns
  - Ch 7. Serving and receiving assets and forms
  - Ch 8. Working with web services
- Part 4. Taking your applications to the cloud
  - Ch 9. Using the cloud
  - Ch 10. Communication between cloud services
  - Ch 11. Reflection and code generation


* Part 1. Background and fundamentals

** Chapter 1. Getting into Go

*** 1.1. What is Go?
*** 1.2. Noteworthy aspects of Go

**** 1.2.1. Multiple return values
[[file:go-in-practice/chapter1/returns.go][chapter1/returns.go]]
[[file:go-in-practice/chapter1/returns2.go][chapter1/returns2.go]]

***** Direct Linking to code
You can open these and type ~, x x~ to run  =spacemacs/go-run-main=
[[file:go-in-practice/chapter1/returns.go][chapter1/returns.go]]
***** INCLUDING the src

~, '~ to open this included file in a dedicated buffer.
~, x x~ to run =spacemacs/go-run-main=
The file (and specific lines) will be included in the export.

#+INCLUDE: "./go-in-practice/chapter1/returns.go" src go :lines "11-18"

***** Inline Code Execution and output

#+NAME: Names
#+BEGIN_SRC go
func Names() (string, string) {
return "Foo", "Bar"
}
#+END_SRC

#+RESULTS: header
#+BEGIN_SRC go

#+END_SRC

#+RESULTS: main
#+BEGIN_SRC go
Foo Bar
Foo
#+END_SRC

- The "underscore" character ~_~ is used to tell the compiler that "I don't care about this variable or it's content"

**** 1.2.2. A modern standard library
[[file:go-in-practice/chapter1/read_status.go][chapter1/read_status.go]]
#+INCLUDE: "./go-in-practice/chapter1/read_status.go" src go

#+NAME: Listing 13 Read TCP status: read_status.go
#+BEGIN_SRC go :imports '("fmt" "bufio" "net")
	conn, _ := net.Dial("tcp", "golang.org:80")
	fmt.Fprintf(conn, "GET / HTTP/1.0\r\n\r\n")
	status, _ := bufio.NewReader(conn).ReadString('\n')
	fmt.Println(status)
#+END_SRC

#+RESULTS: Listing 13 Read TCP status: read_status.go
#+begin_EXPORT text
HTTP/1.0 200 OK
#+end_EXPORT

- Networking and HTTP
  - (net package)
  - TCP / UDP 
  - client or server role
  - bufio package
- Package bufio implements buffered I/O. It wraps an io.Reader or io.Writer object, creating another object (Reader or Writer) that also implements the interface but provides buffering and some help for textual I/O. 


Go - encoding is UTF-8 internally


- interfaces (review more)

- HTML
  - Includes support through ~html~ and ~html/template~ packages
- Cryptography
  - Includes support for common cryptography protocols, SHA, TLS, AES and HMAC
- Data Encoding
  - packages -> turn a JSON string into instantiated objects



