learning/go-in-practice.org
**** 1.2.3. Concurrency with goroutines and channels

- Go scheduler
- "multiple processing cores is now the norm"
- Other languages (aka Ruby) have a "global thread lock" - which hampers running routines in parallel
- "goroutine" , a function that can be run concurrently to the main program or other goroutines. Sometimes dubbed lightweight threads"
  - Figure 1.2 Goroutines running in threads distributed on the available processing cores
  - Listing 1.5 Concurrent output
    - two functions printing concurrently
    - function ~count()~ is run in parallel using the keyword ~go~, e.g. ~go count()~
    - This causes main to continue executing immediately without needing the count() function to finish first.
  
[[file:go-in-practice/chapter1/goroutine.go][chapter1/go_routine.go]]
#+INCLUDE: "./go-in-practice/chapter1/go_routine.go" src go

#+NAME: Listing 1.6 Printing concurrently
#+BEGIN_SRC go :imports '("fmt" "time") :main no
func count() {
	for i := 0; i < 5; i++ {
		fmt.Println(i)
		time.Sleep(time.Millisecond * 1)
	}
}

func main() {
	go count()
	time.Sleep(time.Millisecond * 2)
	fmt.Println("Hello World")
	time.Sleep(time.Millisecond * 5)
}
#+END_SRC

#+RESULTS: Listing 1.6 Printing concurrently
#+begin_EXPORT text
0
1
Hello World
2
3
4
#+end_EXPORT

- Concurrency: "channels"
  - Channels provide a way for two goroutines to communicate with each other.
  - Channels can be one-directional or bidirectional

[[file:go-in-practice/chapter1/channel.go][chapter1/channel.go]]
#+INCLUDE: "./go-in-practice/chapter1/channel.go" src go

#+NAME: Listing 1.7 Using channels: channel.go
#+BEGIN_SRC go :imports '("fmt" "time") :main no
func printCount(c chan int) {
	num := 0
	for num >= 0 {
		num = <-c
		fmt.Print(num, " ")
	}
}

func main() {
	c := make(chan int)
	a := []int{8, 6, 7, 5, 3, 0, 9, -1}

	go printCount(c)

	for _, v := range a {
		c <- v
	}
	time.Sleep(time.Millisecond * 1)
	fmt.Println("End of main")
}
#+END_SRC

#+RESULTS: Listing 1.7 Using channels: channel.go
#+begin_EXPORT text
8 6 7 5 3 0 9 -1 End of main
#+end_EXPORT

**** 1.2.4. Go the toolchain—more than a language

- go executable is a toolchain enabling more than a compiler

- package management
  - lightweight
  - built in from day one
  - improve programmer productivity
  - faster compile time
  - syntax: ~import "fmt"~
  - syntax: ~fmt.Println("Hello Word")~
  - list packages in alphabetical order
  - net/http  << imports only http section? from the net package.
  - external packages - reference by URL.
  - command: ~go get~
  - can use most version-control systems ( git - mercurial - SVN and bazaar ) pg 14
  - Go retrieves the codebase from Git and checks out the latest commit from the default branch.
  - Go has no central repository and packages are fetched from their source location.



- testing
  - Essential element of software development
  - syntax: ~import "testing"~
  - testing package provides
    - a command-line runner
    - code-coverage reporting
    - race-condition detection.
  - naming convention for test files: end in ~_test.go~
    - excluded when the application is built
  - Command: ~go test~
    - executes the function that begins with Test e.g. TestName
  - Command: ~go test ./...~
    - Test the current package and the ones nested in subdirectories
  - Test Results
    - Listing 1.12 - PASS
    - Listing 1.13 - FAIL
  - Use other packages for BDD or other testing patterns
  - Code Coverage
    - Command ~go test -cover~
    - Reports the % of coverage provided
    - Listing 1.14 - output
    - Export results to files that be used by other tools (example?)
    - http://blog.golang.org/cover
  - More details on Testing in Chapter 4

- TODO Explore gocheck / go-use-gocheck-for-testing
https://github.com/syl20bnr/spacemacs/tree/master/layers/%2Blang/go#tests

[[file:go-in-practice/chapter1/hello/hello.go][chapter1/hello/hello.go]]
#+INCLUDE: "./go-in-practice/chapter1/hello/hello.go" src go

#+NAME: Listing 1.10 Hello World: hello.go
#+BEGIN_SRC go :imports '("fmt") :main no
func getName() string {
	return "World!"
}

func main() {
	name := getName()
	fmt.Println("Hello ", name)
}
#+END_SRC

#+RESULTS: Listing 1.10 Hello World: hello.go
#+begin_EXPORT text
Hello  World!
#+end_EXPORT


To test, open this file and run ~, t t~ 
[[file:go-in-practice/chapter1/hello/hello_test.go::/getName(/][chapter1/hello/hello_test.go]]
#+INCLUDE: "./go-in-practice/chapter1/hello/hello_test.go" src go

#+NAME: Listing 1.12 Running go test manually
#+BEGIN_SRC shell :dir go-in-practice/chapter1/hello
go test
#+END_SRC

#+RESULTS: Listing 1.12 Running go test manually
#+begin_EXAMPLE
PASS
ok  	_/home/heyste/ii/org/learning/go-in-practice/chapter1/hello	0.002s
#+end_EXAMPLE

#+NAME: Listing 1.14 Testing with code coverage
#+BEGIN_SRC shell :dir go-in-practice/chapter1/hello
go test -cover
#+END_SRC

#+RESULTS: Listing 1.14 Testing with code coverage
#+begin_EXAMPLE
PASS
coverage: 33.3% of statements
ok  	_/home/heyste/ii/org/learning/go-in-practice/chapter1/hello	0.002s
#+end_EXAMPLE


[[http://blog.golang.org/cover]]


- Formatting
  - Tabs vs Spaces ? Style issues/discussions don't help with developer productivity
  - Idiomatic Go - https://golang.org/doc/effective_go.html (Effective Go)
  - Command: ~go fmt~
  - Rewrites all go files to canonical style.
  - Use a hook on save to update the current format

  - Explore: Emacs save hook / pre-git commit
  - Explore: Convert tab to spaces view options

We have some go-lang spacemacs settings to run go fmt on save etc.
Might be interesting to see pre-git commit
http://spacemacs.org/layers/+lang/go/README.html
https://github.com/syl20bnr/spacemacs/tree/master/layers/%2Blang/go

- documentation generation
- compiler
- locate extra options - check: go --help

#+NAME: go extra compiler options
#+BEGIN_SRC shell :epilogue ") 2>&1\n:" :prologue "(\n"
go --help
#+END_SRC

#+RESULTS: go extra compiler options
#+begin_EXAMPLE
Go is a tool for managing Go source code.

Usage:

	go <command> [arguments]

The commands are:

	bug         start a bug report
	build       compile packages and dependencies
	clean       remove object files and cached files
	doc         show documentation for package or symbol
	env         print Go environment information
	fix         update packages to use new APIs
	fmt         gofmt (reformat) package sources
	generate    generate Go files by processing source
	get         download and install packages and dependencies
	install     compile and install packages and dependencies
	list        list packages or modules
	mod         module maintenance
	run         compile and run Go program
	test        test packages
	tool        run specified go tool
	version     print Go version
	vet         report likely mistakes in packages

Use "go help <command>" for more information about a command.

Additional help topics:

	buildmode   build modes
	c           calling between Go and C
	cache       build and test caching
	environment environment variables
	filetype    file types
	go.mod      the go.mod file
	gopath      GOPATH environment variable
	gopath-get  legacy GOPATH go get
	goproxy     module proxy protocol
	importpath  import path syntax
	modules     modules, module versions, and more
	module-get  module-aware go get
	packages    package lists and patterns
	testflag    testing flags
	testfunc    testing functions

Use "go help <topic>" for more information about that topic.

#+end_EXAMPLE

