learning/go-in-practice.md

3.  1.2.3. Concurrency with goroutines and channels

    -   Go scheduler
    -   "multiple processing cores is now the norm"
    -   Other languages (aka Ruby) have a "global thread lock" - which hampers running routines in parallel
    -   "goroutine" , a function that can be run concurrently to the main program or other goroutines. Sometimes dubbed lightweight threads"
        -   Figure 1.2 Goroutines running in threads distributed on the available processing cores
        -   Listing 1.5 Concurrent output
            -   two functions printing concurrently
            -   function `count()` is run in parallel using the keyword `go`, e.g. `go count()`
            -   This causes main to continue executing immediately without needing the count() function to finish first.
    
    [chapter1/goroutine.go](go-in-practice/chapter1/goroutine.go)
    
    ```go
    package main
    
    import (
      "fmt"
      "time"
    )
    
    func count() {
      for i := 0; i < 5; i++ {
        fmt.Println(i)
        time.Sleep(time.Millisecond * 1)
      }
    }
    
    func main() {
      go count()
      time.Sleep(time.Millisecond * 2)
      fmt.Println("Hello World")
      time.Sleep(time.Millisecond * 5)
    }
    ```
    
    ```go
    func count() {
      for i := 0; i < 5; i++ {
        fmt.Println(i)
        time.Sleep(time.Millisecond * 1)
      }
    }
    
    func main() {
      go count()
      time.Sleep(time.Millisecond * 2)
      fmt.Println("Hello World")
      time.Sleep(time.Millisecond * 5)
    }
    ```
    
    -   Concurrency: "channels"
        -   Channels provide a way for two goroutines to communicate with each other.
        -   Channels can be one-directional or bidirectional
    
    [chapter1/channel.go](go-in-practice/chapter1/channel.go)
    
    ```go
    package main
    
    import (
      "fmt"
      "time"
    )
    
    func printCount(c chan int) {
      num := 0
      for num >= 0 {
        num = <-c
        fmt.Print(num, " ")
      }
    }
    
    func main() {
      c := make(chan int)
      a := []int{8, 6, 7, 5, 3, 0, 9, -1}
    
      go printCount(c)
    
      for _, v := range a {
        c <- v
      }
      time.Sleep(time.Millisecond * 1)
      fmt.Println("End of main")
    }
    ```
    
    ```go
    func printCount(c chan int) {
      num := 0
      for num >= 0 {
        num = <-c
        fmt.Print(num, " ")
      }
    }
    
    func main() {
      c := make(chan int)
      a := []int{8, 6, 7, 5, 3, 0, 9, -1}
    
      go printCount(c)
    
      for _, v := range a {
        c <- v
      }
      time.Sleep(time.Millisecond * 1)
      fmt.Println("End of main")
    }
    ```

4.  1.2.4. Go the toolchain—more than a language

    -   go executable is a toolchain enabling more than a compiler
    
    -   package management
        -   lightweight
        -   built in from day one
        -   improve programmer productivity
        -   faster compile time
        -   syntax: `import "fmt"`
        -   syntax: `fmt.Println("Hello Word")`
        -   list packages in alphabetical order
        -   net/http << imports only http section? from the net package.
        -   external packages - reference by URL.
        -   command: `go get`
        -   can use most version-control systems ( git - mercurial - SVN and bazaar ) pg 14
        -   Go retrieves the codebase from Git and checks out the latest commit from the default branch.
        -   Go has no central repository and packages are fetched from their source location.
    
    -   testing
        -   Essential element of software development
        -   syntax: `import "testing"`
        -   testing package provides
            -   a command-line runner
            -   code-coverage reporting
            -   race-condition detection.
        -   naming convention for test files: end in `_test.go`
            -   excluded when the application is built
        -   Command: `go test`
            -   executes the function that begins with Test e.g. TestName
        -   Command: `go test ./...`
            -   Test the current package and the ones nested in subdirectories
        -   Test Results
            -   Listing 1.12 - PASS
            -   Listing 1.13 - FAIL
        -   Use other packages for BDD or other testing patterns
        -   Code Coverage
            -   Command `go test -cover`
            -   Reports the % of coverage provided
            -   Listing 1.14 - output
            -   Export results to files that be used by other tools (example?)
            -   <http://blog.golang.org/cover>
        -   More details on Testing in Chapter 4
    
    -   TODO Explore gocheck / go-use-gocheck-for-testing
    
    <https://github.com/syl20bnr/spacemacs/tree/master/layers/%2Blang/go#tests>
    
    [chapter1/hello/hello.go](go-in-practice/chapter1/hello/hello.go)
    
    ```go
    package main
    
    import "fmt"
    
    func getName() string {
      return "World!"
    }
    
    func main() {
      name := getName()
      fmt.Println("Hello ", name)
    }
    ```
    
    ```go
    func getName() string {
      return "World!"
    }
    
    func main() {
      name := getName()
      fmt.Println("Hello ", name)
    }
    ```
    
    To test, open this file and run `, t t` [chapter1/hello/hello<sub>test.go</sub>](go-in-practice/chapter1/hello/hello_test.go)
    
    ```go
    package main
    
    import "testing"
    
    func TestName(t *testing.T) {
      name := getName()
    
      if name != "World!" {
        t.Error("Respone from getName is unexpected value")
      }
    }
    ```
    
    ```shell
    go test
    ```
    
    ```shell
    go test -cover
    ```
    
    <http://blog.golang.org/cover>
    
    -   Formatting
        -   Tabs vs Spaces ? Style issues/discussions don't help with developer productivity
        -   Idiomatic Go - <https://golang.org/doc/effective_go.html> (Effective Go)
        -   Command: `go fmt`
        -   Rewrites all go files to canonical style.
        -   Use a hook on save to update the current format
        
        -   Explore: Emacs save hook / pre-git commit
        -   Explore: Convert tab to spaces view options
    
    We have some go-lang spacemacs settings to run go fmt on save etc. Might be interesting to see pre-git commit <http://spacemacs.org/layers/+lang/go/README.html> <https://github.com/syl20bnr/spacemacs/tree/master/layers/%2Blang/go>
    
    -   documentation generation
    -   compiler
    -   locate extra options - check: go &#x2013;help
    
    ```shell
    go --help
    ```
