learning/go-in-practice.md

### 1.3. Go in the vast language landscape<a id="sec-3-1-3"></a>

-   Go design was for "systems language", with cloud computing a subset.
-   Not good focus for embedded systems due to the runtime and garbage collection.
-   Alternative to C
-   Go provides a runtime that includes features such as managing threads and garbage collection.
-   Go applications have a sweet spot that provides real productivity.
-   Go compiles to a single binary for an operating system to directly execute.
    -   The binary contains the Go runtime, all the imported packages and the entire application.
    -   everything needed to run the program is within a single binary
-   Performance between languages isn't straightforward
-   Go is a statically typed language with dynamic-like features.
    -   Statically typed languages do type checking based on static code analysis.
    -   Go has the ability to do some type switching. Under some circumstances, variables of one type can be turned into variables of a different type.
-   Go has a built-in web server, as illustrated in figure 1.6 (pg 20)

### 1.4. Getting up and running in Go<a id="sec-3-1-4"></a>

-   [http://tour.golang.org](http://tour.golang.org)
-   [https://play.golang.org](https://play.golang.org)

1.  1.4.1. Installing Go

    -   [https://golang.org/dl/](https://golang.org/dl/)

2.  1.4.2. Working with Git, Mercurial, and version control

3.  1.4.3. Exploring the workspace

    -   Go code is expected to be in a workspace.
    -   Base directory referenced by `GOPATH`
    -   workspace has a set directory hierarchy (
        -   bin
        -   pkg
        -   src
    -   Command `go install`
        -   manages the `bin` directory
    -   archive files ?
        -   file suffix .a
        -   stored in the `pkg` directory

4.  1.4.4. Working with environment variables

    -   go executable expect the variable to exist.
    -   `export PATH=$PATH:$GOPATH/bin`
    -   An optional environment variable `GOBIN` for installing binaries to an alternative location,

### 1.5. Hello, Go<a id="sec-3-1-5"></a>

-   Create a web server

[chapter1/hello/inigo.go](go-in-practice/chapter1/inigo.go)

```go
package main

import (
  "fmt"
  "net/http"
)

func hello(res http.ResponseWriter, req *http.Request) {
  fmt.Fprint(res, "Hello, my name is Inigo Montoya")
}

func main() {
  http.HandleFunc("/", hello)
  http.ListenAndServe("localhost:4000", nil)
}
```

```emacs-lisp
;; (setenv "GOPATH" (concat (file-name-directory (buffer-file-name))
            ;; "go-in-practice/chapter1/"))
;;(setenv "GOPATH" nil)
(compile "go run inigo.go") t)
(sleep-for 2)
(display-buffer-at-bottom (get-buffer "*compilation*") nil)
(browse-url-chromium "http:localhost:4000")  2
```

```shell
go build inigo.go
ls -la inigo
# ./inigo
```

-   Command: `go build`
    -   will build the current directory
    -   using a filename, set of filenames, only builds the selection.
    -   the built application needs to be executed

### 1.6. Summary<a id="sec-3-1-6"></a>

-   designed for modern hardware
-   advantage of recent advances in technology
-   provides a toolchain that makes the developer productive
-   goroutines enable concurrent execution

## Chapter 2. A solid foundation<a id="sec-3-2"></a>

### 2.1. Working with CLI applications, the Go way<a id="sec-3-2-1"></a>

-   2.1.1. Command-line flags
-   2.1.2. Command-line frameworks

### 2.2. Handling configuration<a id="sec-3-2-2"></a>

-   Technique 3 Using configuration files
-   Technique 4 Configuration via environment variables

### 2.3. Working with real-world web servers<a id="sec-3-2-3"></a>

-   2.3.1. Starting up and shutting down a server
-   2.3.2. Routing web requests

### 2.4. Summary<a id="sec-3-2-4"></a>

## Chapter 3. Concurrency in Go<a id="sec-3-3"></a>

### 3.1. Understanding Go’s concurrency model<a id="sec-3-3-1"></a>

### 3.2. Working with goroutines<a id="sec-3-3-2"></a>

-   Technique 10 Using goroutine closures
-   Technique 11 Waiting for goroutines
-   Technique 12 Locking with a mutex

### 3.3. Working with channels<a id="sec-3-3-3"></a>

-   Technique 13 Using multiple channels
-   Technique 14 Closing channels
-   Technique 15 Locking with buffered channels

### 3.4. Summary<a id="sec-3-3-4"></a>

# Part 2. Well-rounded applications<a id="sec-4"></a>

## Chapter 4. Handling errors and panics<a id="sec-4-1"></a>

### 4.1. Error handling<a id="sec-4-1-1"></a>

-   Technique 16 Minimize the nils
-   Technique 17 Custom error types
-   Technique 18 Error variables

### 4.2. The panic system<a id="sec-4-1-2"></a>

-   4.2.1. Differentiating panics from errors
-   4.2.2. Working with panics
-   4.2.3. Recovering from panics
-   4.2.4. Panics and goroutines

### 4.3. Summary<a id="sec-4-1-3"></a>

## Chapter 5. Debugging and testing<a id="sec-4-2"></a>

### 5.1. Locating bugs<a id="sec-4-2-1"></a>

-   5.1.1. Wait, where is my debugger?

### 5.2. Logging<a id="sec-4-2-2"></a>

-   5.2.1. Using Go’s logger
-   5.2.2. Working with system loggers

### 5.3. Accessing stack traces<a id="sec-4-2-3"></a>

-   Technique 26 Capturing stack traces

### 5.4. Testing<a id="sec-4-2-4"></a>

-   5.4.1. Unit testing
-   5.4.2. Generative testing

### 5.5. Using performance tests and benchmarks<a id="sec-4-2-5"></a>

-   Technique 29 Benchmarking Go code
-   Technique 30 Parallel benchmarks
-   Technique 31 Detecting race conditions

### 5.6. Summary<a id="sec-4-2-6"></a>

# Part 3. An interface for your applications<a id="sec-5"></a>

## Chapter 6. HTML and email template patterns<a id="sec-5-1"></a>

### 6.1. Working with HTML templates<a id="sec-5-1-1"></a>

-   6.1.1. Standard library HTML package overview
-   6.1.2. Adding functionality inside templates
-   6.1.3. Limiting template parsing
-   6.1.4. When template execution breaks
-   6.1.5. Mixing templates

### 6.2. Using templates for email<a id="sec-5-1-2"></a>

-   Technique 38 Generating email from templates

### 6.3. Summary<a id="sec-5-1-3"></a>

## Chapter 7. Serving and receiving assets and forms<a id="sec-5-2"></a>

### 7.1. Serving static content<a id="sec-5-2-1"></a>

-   Technique 39 Serving subdirectories
-   Technique 40 File server with custom error pages
-   Technique 41 Caching file server
-   Technique 42 Embedding files in a binary
-   Technique 43 Serving from an alternative location

### 7.2. Handling form posts<a id="sec-5-2-2"></a>

-   7.2.1. Introduction to form requests
-   7.2.2. Working with files and multipart submissions
-   7.2.3. Working with raw multipart data

### 7.3. Summary<a id="sec-5-2-3"></a>

## Chapter 8. Working with web services<a id="sec-5-3"></a>

### 8.1. Using REST APIs<a id="sec-5-3-1"></a>

-   8.1.1. Using the HTTP client
-   8.1.2. When faults happen

### 8.2. Passing and handling errors over HTTP<a id="sec-5-3-2"></a>

-   8.2.1. Generating custom errors
-   8.2.2. Reading and using custom errors

### 8.3. Parsing and mapping JSON<a id="sec-5-3-3"></a>

-   Technique 53 Parsing JSON without knowing the schema

### 8.4. Versioning REST APIs<a id="sec-5-3-4"></a>

-   Technique 54 API version in the URL
-   Technique 55 API version in content type

### 8.5. Summary<a id="sec-5-3-5"></a>

# Part 4. Taking your applications to the cloud<a id="sec-6"></a>

## Chapter 9. Using the cloud<a id="sec-6-1"></a>

### 9.1. What is cloud computing?<a id="sec-6-1-1"></a>

-   9.1.1. The types of cloud computing
-   9.1.2. Containers and cloud-native applications

### 9.2. Managing cloud services<a id="sec-6-1-2"></a>

-   9.2.1. Avoiding cloud provider lock-in
-   9.2.2. Dealing with divergent errors

### 9.3. Running on cloud servers<a id="sec-6-1-3"></a>

-   9.3.1. Performing runtime detection
-   9.3.2. Building for the cloud
-   9.3.3. Performing runtime monitoring

### 9.4. Summary<a id="sec-6-1-4"></a>

## Chapter 10. Communication between cloud services<a id="sec-6-2"></a>

### 10.1. Microservices and high availability<a id="sec-6-2-1"></a>

### 10.2. Communicating between services<a id="sec-6-2-2"></a>

1.  10.2.1. Making REST faster

    1.  TECHNIQUE 62: Reusing connections
    
    2.  TECHNIQUE 63: Faster JSON marshal and unmarshal
    
        -   <https://github.com/ugorji/go>

2.  10.2.2. Moving beyond REST

    1.  TECHNIQUE 64: Using protocol buffers
    
    2.  TECHNIQUE 65: Communicating over RPC with protocol buffers

### 10.3. Summary<a id="sec-6-2-3"></a>

## Chapter 11. Reflection and code generation<a id="sec-6-3"></a>
