learning/go-in-practice.org
*** 11.1. Three features of reflection

- Technique 66 Switching based on type and kind
- Technique 67 Discovering whether a value implements an interface
- Technique 68 Accessing fields on a struct

*** 11.2. Structs, tags, and annotations

- 11.2.1. Annotating structs
- 11.2.2. Using tag annotations

*** 11.3. Generating Go code with Go code

- Technique 70 Generating code with go generate

*** 11.4. Summary


* End Matter

** Index
** List of Figures
** List of Listings


* Extra Notes

- [[https://github.com/mdempsky/gocode][gocode: An autocompletion daemon for the Go programming language]] 

  
* References


- Test link to PDF: [[docview:go-in-practice.pdf::105][pg105]]
* Footnotes
[[file:/usr/local/share/emacs/site-lisp/spacemacs/layers/+lang/go/README.org::*Go%20commands%20(start%20with%20=m=):][Keybindings]]
** local pdf link to pages
If you are running in a gui, you can view the local PDF in docview.
- [[docview:go-in-practice.pdf]]
- [[docview:go-in-practice.pdf::300]]
Searches and links to headers don't quite work:
- [[docview:go-in-practice.pdf:/The%20queue%20template/]]
You can view it in docview 


** TODO write or find ob-golang so ,, works for org golang blocks
** TODO Delve
** TODO go-playground

** TODO look into gocheck
** TODO go-coverage
** TODO go-guru
https://docs.google.com/document/d/1_Y9xCEMj5S-7rv2ooHpZNH15JgRT5iM742gJkw5LtmQ/edit
** TODO gocode => gogetdoc
May need to run =go set autobuild true= or something similar.
See [[file:/usr/local/share/emacs/site-lisp/spacemacs/layers/+lang/go/README.org::*Autocomplete][Autocomplete]]
** TODO go-use-test-args
#+BEGIN_SRC emacs-lisp
;; go layer cofig
(go :variables go-use-test-args "-race -timeout 10s")
#+END_SRC

** Go Spacemacs Layer Pre-requisites

#+BEGIN_SRC shell
(gocode) 2>&1
echo $?
#+END_SRC

#+BEGIN_SRC tmate :eval never-export
go get -u -v github.com/fatih/gomodifytags
#+END_SRC


#+BEGIN_SRC tmate :eval never-export
go get -u -v github.com/godoctor/godoctor
go install github.com/godoctor/godoctor
#+END_SRC


#+BEGIN_SRC tmate :eval never-export
  go get -u github.com/golangci/golangci-lint/cmd/golangci-lint
#+END_SRC


#+BEGIN_SRC tmate :eval never-export
  go get -u -v github.com/mdempsky/gocode
  go get -u -v github.com/rogpeppe/godef
  go get -u -v golang.org/x/tools/cmd/guru
  go get -u -v golang.org/x/tools/cmd/gorename
  go get -u -v golang.org/x/tools/cmd/goimports
  go get -u -v golang.org/x/tools/cmd/godoc
  go get -u -v github.com/zmb3/gogetdoc
  go get -u -v github.com/cweill/gotests/...
  go get -u github.com/haya14busa/gopkgs/cmd/gopkgs
  go get -u -v github.com/davidrjenni/reftools/cmd/fillstruct
  go get -u github.com/josharian/impl
#+END_SRC


