learning/go-in-practice.md

### 11.1. Three features of reflection<a id="sec-6-3-1"></a>

-   Technique 66 Switching based on type and kind
-   Technique 67 Discovering whether a value implements an interface
-   Technique 68 Accessing fields on a struct

### 11.2. Structs, tags, and annotations<a id="sec-6-3-2"></a>

-   11.2.1. Annotating structs
-   11.2.2. Using tag annotations

### 11.3. Generating Go code with Go code<a id="sec-6-3-3"></a>

-   Technique 70 Generating code with go generate

### 11.4. Summary<a id="sec-6-3-4"></a>

# End Matter<a id="sec-7"></a>

## Index<a id="sec-7-1"></a>

## List of Figures<a id="sec-7-2"></a>

## List of Listings<a id="sec-7-3"></a>

# Extra Notes<a id="sec-8"></a>

-   [gocode: An autocompletion daemon for the Go programming language](https://github.com/mdempsky/gocode)

# References<a id="sec-9"></a>

-   Test link to PDF: /home/hippie/ii/org/learning/go-in-practice.pdf
